#include <iostream>

/*
Напишете програма, която приема естествено число n
(n < 100) и k други цели числа. Програмата да 
определя кои от числата в интервала [1,...,n] са 
делители на числа, въведени от потребителя. 
Потребителят въвежда числата едно по едно от 
стандартния вход (след въвеждането на n). 
Броят не въведените числа е неограничен. 
Въвеждането на числата приключва, когато се въведе числото 0.
*/

unsigned int const MAX_SIZE = 100;

int main() {

  bool divisors[MAX_SIZE] {};

  int n, k;
  std::cin >> n >> k;
  while (k != 0) {
    for (int i = 1; i <= n; ++i) {
      //първата позиция в масива не ни интересува,
      //тъй като представя числото 0
      if (k%i == 0) divisors[i] = true;
    }
    std::cin >> k;
  }

  for (unsigned int i = 1; i < MAX_SIZE; ++i) {
    if (divisors[i]) std::cout << i << ' ';
  }

  return 0;
}